; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph1 - mode
	thermograph2 - mode
	spectrograph5 - mode
	image4 - mode
	infrared3 - mode
	image0 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument1 image0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument3 infrared3)
	(supports instrument3 image4)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 thermograph2)
	(supports instrument4 image4)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(have_image Star5 thermograph2)
	(have_image Star5 image0)
	(have_image Star6 spectrograph5)
	(have_image Star6 image4)
	(have_image Phenomenon7 image4)
	(have_image Planet8 spectrograph5)
	(have_image Star9 spectrograph5)
	(have_image Star9 infrared3)
	(have_image Planet10 image4)
	(have_image Planet10 thermograph2)
	(have_image Phenomenon11 image0)
	(have_image Phenomenon11 thermograph2)
	(have_image Planet12 spectrograph5)
	(have_image Planet12 image4)
))

)

; plan
1. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 15
2. (calibrate satellite3 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 15
3. (turn_to satellite3 planet12 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet12)
   goals met: 0 of 15
4. (take_image satellite3 planet12 instrument4 image4)
   added: (have_image planet12 image4)
   goals met: 1 of 15
5. (turn_to satellite3 phenomenon7 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon7)
   goals met: 1 of 15
6. (turn_to satellite1 star2 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star2)
   goals met: 1 of 15
7. (take_image satellite3 phenomenon7 instrument4 image4)
   added: (have_image phenomenon7 image4)
   goals met: 2 of 15
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 15
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 15
10. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 2 of 15
11. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 15
12. (turn_to satellite0 planet12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet12)
   goals met: 2 of 15
13. (take_image satellite0 planet12 instrument0 spectrograph5)
   added: (have_image planet12 spectrograph5)
   goals met: 3 of 15
14. (turn_to satellite0 planet8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet8)
   goals met: 3 of 15
15. (take_image satellite0 planet8 instrument0 spectrograph5)
   added: (have_image planet8 spectrograph5)
   goals met: 4 of 15
16. (turn_to satellite0 star6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star6)
   goals met: 4 of 15
17. (take_image satellite0 star6 instrument0 spectrograph5)
   added: (have_image star6 spectrograph5)
   goals met: 5 of 15
18. (turn_to satellite0 star9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star9)
   goals met: 5 of 15
19. (take_image satellite0 star9 instrument0 infrared3)
   added: (have_image star9 infrared3)
   goals met: 6 of 15
20. (take_image satellite0 star9 instrument0 spectrograph5)
   added: (have_image star9 spectrograph5)
   goals met: 7 of 15
21. (turn_to satellite0 phenomenon7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon7)
   goals met: 8 of 15
22. (turn_to satellite1 phenomenon11 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon11)
   goals met: 8 of 15
23. (take_image satellite1 phenomenon11 instrument1 image0)
   added: (have_image phenomenon11 image0)
   goals met: 9 of 15
24. (take_image satellite1 phenomenon11 instrument1 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 10 of 15
25. (turn_to satellite1 star5 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star5)
   goals met: 10 of 15
26. (take_image satellite1 star5 instrument1 image0)
   added: (have_image star5 image0)
   goals met: 11 of 15
27. (take_image satellite1 star5 instrument1 thermograph2)
   added: (have_image star5 thermograph2)
   goals met: 12 of 15
28. (turn_to satellite3 planet10 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 planet10)
   goals met: 12 of 15
29. (take_image satellite3 planet10 instrument4 image4)
   added: (have_image planet10 image4)
   goals met: 13 of 15
30. (take_image satellite3 planet10 instrument4 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 14 of 15
31. (turn_to satellite3 star6 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star6)
   goals met: 14 of 15
32. (take_image satellite3 star6 instrument4 image4)
   added: (have_image star6 image4)
   goals met: 15 of 15
